In [ ]:
# Importing json and sql data -> https://youtu.be/dA6ZksRR6aw?si=p5MduvERgNz_5vmA&t=3867

In [1]:
import numpy as np
import pandas as pd

# json data

In [6]:
pd.read_json('jsondata.json')

   id     name  age           city  is_student
0   1    Alice   25       New York       False
1   2      Bob   30    Los Angeles        True
2   3  Charlie   22        Chicago       False
3   4    David   28  San Francisco        True
4   5      Eve   27        Seattle       False
5   6    Frank   31         Austin        True
6   7    Grace   24         Boston       False

# sql data

In [ ]:
# this function explained -> https://youtu.be/dA6ZksRR6aw?si=x67lZ3uk7h8oASYo&t=4547



# host: the hostname or IP address of the MySQL server
# user: the username to authenticate with(by default it is root, when working with xampp)
# password: the password for the given user (if not empty string)
# database: the name of the database to connect to 

import mysql.connector
conn = mysql.connector.connect(host='localhost',user='root',password='',database='sample')
# -> we get mysql connection object
conn

In [ ]:
# pd.read_sql_query explained -> https://youtu.be/dA6ZksRR6aw?si=KuaaB6Xf4zqf4cZe&t=4607


# it takes to connection object and sql query as arguments
# and you can perform all sort of sql queries in `sql` parameter
pd.read_sql_query(con=conn,sql='SELECT * FROM employees')

C:\Users\Vedansh\AppData\Local\Temp\ipykernel_36028\2434865942.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(con=conn,sql='SELECT * FROM employees')

   id     name  age   department    salary   join_date
0   1    Alice   28           HR  55000.00  2021-06-01
1   2      Bob   35  Engineering  85000.50  2020-03-15
2   3  Charlie   30        Sales  60000.00  2019-09-10
3   4    Diana   24    Marketing  50000.00  2022-01-25
4   5    Ethan   40      Finance  95000.00  2018-11-05
5   6      Fay   32  Engineering  88000.75  2020-12-11
6   7   George   29           HR  57000.00  2021-08-19